
<template>
  <view>
    <div>
      <div style="{text-align: center;font-size:28px;font-weight:bold}">{{constConfig.title}}用户隐私政策</div>
      <br />
      <div>我们非常重视用户的隐私，本政策将说明我们会收集哪些信息以及如何使用、保护和共享这些信息。请您在使用我们的产品或服务前，仔细阅读并了解本政策的内容。如您不同意本政策的任何内容，请您立即停止使用我们的服务。</div>
      <br />
      <div>一、我们会收集哪些信息</div>
      <br />
      <div>1.1 您提供给我们的信息</div>
      <br />
      <div>您在注册帐号、使用我们的服务或参加我们的活动时，向我们提供的个人信息，包括但不限于：</div>
      <br />
      <div>（1）个人身份信息：例如姓名等；</div>
      <br />
      <div>（2）联系方式：例如电子邮件地址、手机号码等；</div>
      <br />
      <div>（3）交易信息：例如收货地址、收货人姓名、收货人手机号码、商品信息等。</div>
      <br />
      <div>1.2 我们自动收集的信息</div>
      <br />
      <div>当您使用我们的服务时，我们会自动收集如下信息：</div>
      <br />
      <div>（1）设备信息：例如您的设备型号、操作系统版本、唯一设备标识符等；</div>
      <br />
      <div>（2）日志信息：例如您使用我们的服务的具体时间、持续时间、访问地址、浏览记录等；</div>
      <br />
      <div>（3）位置信息：例如您的地理位置。</div>
      <br />
      <div>二、我们如何使用您的信息</div>
      <br />
      <div>2.1 为您提供服务</div>
      <br />
      <div>我们会将您的信息用于以下用途：</div>
      <br />
      <div>（1）提供您需要的产品或服务；</div>
      <br />
      <div>（2）处理交易或提供售后服务；</div>
      <br />
      <div>（3）识别您的身份，以便向您提供更好的服务；</div>
      <br />
      <div>（4）防止欺诈或其他违法行为。</div>
      <br />
      <div>2.2 为您提供个性化的内容或广告</div>
      <br />
      <div>我们可能会根据您的使用习惯或信息为您提供个性化的内容。</div>
      <br />
      <div>2.3 共享给第三方</div>
      <br />
      <div>我们不会向任何未经授权的第三方共享您的个人信息。但在以下情况下，我们可能会与第三方共享您的个人信息：</div>
      <br />
      <div>（1）经过您的明确同意；</div>
      <br />
      <div>（2）为了满足法律、法规、法院命令或政府部门的要求；</div>
      <br />
      <div>三、我们如何保护您的信息</div>
      <br />
      <div>3.1 信息安全</div>
      <br />
      <div>我们会采取各种安全措施保护您的信息，防止未经授权的访问、使用、披露、修改、损坏或丢失。</div>
      <br />
      <div>3.3 信息访问控制</div>
      <br />
      <div>我们会采用严格的访问控制措施，只有授权人员才能访问您的个人信息，并且仅在必要时才能访问。</div>
      <br />
      <div>3.4 信息保留</div>
      <br />
      <div>我们会根据法律法规的要求，将您的信息保存至法定期限。在这段时间内，我们将严格保密您的信息，除非经过您的明确授权，否则不会将其披露给任何第三方。</div>
      <br />
      <div>四、隐私政策的更新和公告</div>
      <br />
      <div>我们保留随时更新本隐私政策的权利。如有任何重大变更，我们会在页面上显著位置发布通知。请您定期查看本政策，以便及时了解我们对您的个人信息的处理方式。</div>
      <br />
      <div>五、如何联系我们</div>
      <br />
      <div>如您对本隐私政策有任何疑问或意见，请通过我们的官方客服渠道与我们联系，我们将竭诚为您服务。</div>
    </div>
  </view>
</template>
<script setup>
import constConfig from '../../config/confg'
const onShareAppMessage = () => {
  return {
    title: constConfig.title,
    imageUrl: '',
    path: '/pages/index/index'
  }
}

</script>
<style scoped>
div {
  text-indent: 2em;
}
</style>