
<template>
  <view>
    <div>
      <div style="{text-align: center;font-size:28px;font-weight:bold}">用户服务协议</div>
      <br />
      <div>
        欢迎使用肥猫猫情趣商城（以下简称&ldquo;本商城&rdquo;）服务，本协议是您（以下简称&ldquo;用户&rdquo;）与本商城之间的法律协议。在使用本商城服务之前，请您仔细阅读本协议。如果您不同意本协议的任何内容，请您立即停止使用本商城服务。如果您使用本商城服务，则视为您已经完全同意本协议的所有内容。
      </div>
      <br />
      <div>一、服务条款</div>
      <br />
      <div>1.1 本商城的所有权和运营权归本商城所有。</div>
      <br />
      <div>1.2 本商城为用户提供商品信息展示、下单购买、支付、配送等服务，同时提供用户评论、商品评价等互动社区服务。</div>
      <br />
      <div>1.3 用户在使用本商城服务的过程中，必须遵守中国法律法规的规定，不得利用本商城从事违法犯罪等活动，否则本商城将有权终止与该用户的服务协议并追究其法律责任。</div>
      <br />
      <div>二、用户账号</div>
      <br />
      <div>2.1 用户在使用本商城服务前需要注册账号，并提供真实、准确、完整的个人信息。用户需对自己账号的所有活动和事件负法律责任。</div>
      <br />
      <div>2.2 用户账号仅供其本人使用，不得转让、出售或共享账号密码。如用户发现账号被盗用或存在安全漏洞，应立即通知本商城。</div>
      <br />
      <div>2.3 本商城有权根据实际情况中止或终止用户的账号，并有权删除该账号及其相关数据。</div>
      <br />
      <div>三、商品信息</div>
      <br />
      <div>3.1 本商城展示的商品信息，包括但不限于商品的价格、参数、图片、描述等均为参考信息，不代表商品的最终销售属性及价格，用户需以实际下单页面展示的价格为准。</div>
      <br />
      <div>3.2 用户需仔细阅读商品详情页面展示的商品属性、包装、数量、配送及售后服务等信息，并在确认无误后再下单购买。</div>
      <br />
      <div>3.3 用户对于商品的退换货需遵循本商城的退换货政策，如未按照政策操作可能导致退换货失败。</div>
      <br />
      <div>四、支付及配送</div>
      <br />
      <div>4.1 用户下单成功后，需根据实际情况及时完成支付。</div>
      <br />
      <div>4.2 本商城将在用户完成支付后尽快为其发货，并提供物流查询服务。</div>
      <br />
      <div>4.3 本商城提供的配送服务由第三方物流公司承担，用户需遵守物流公司的规定及要求，如未能及时收货可能导致包裹退回或丢失。</div>
      <br />
      <div>4.4 如因用户提供的收货地址、联系电话等信息错误或不完整导致物流配送异常，本商城概不负责。</div>
      <br />
      <div>4.5 如因商品质量问题或未能按时发货等原因，导致用户投诉或退货，本商城将根据实际情况协助用户处理，并及时予以反馈。</div>
      <br />
      <div>五、售后服务</div>
      <br />
      <div>5.1 本商城保证所售商品均为正品，并且与描述相符。</div>
      <br />
      <div>5.2 如因商品质量问题或未能按时发货等原因，导致用户投诉或退货，本商城将根据实际情况协助用户处理，并及时予以反馈。</div>
      <br />
      <div>5.3 因为商品的特殊性不支持无理由退货，该商城下所有货物非质量问题一律不支持退货。</div>
      <br />
      <div>六、用户隐私保护</div>
      <br />
      <div>6.1 本商城将严格保护用户的个人隐私，不会向第三方泄露用户的个人信息，除非事先得到用户的明确授权或根据法律法规的规定。</div>
      <br />
      <div>6.2 本商城将采取合理措施保护用户的个人信息，防止用户的个人信息被未经授权的访问、使用或泄漏。</div>
      <br />
      <div>6.3 我们十分重视用户隐私，将严格遵守相关隐私保护法律法规。我们的隐私政策将对我们收集、使用、保存和披露用户信息的规则作出明确说明。用户在使用我们的服务前，请仔细阅读隐私政策的全部内容。</div>
      <br />
      <div>七、用户评论</div>
      <br />
      <div>7.1</div>
      <div>
        用户在小程序商城内的任何评论、评价、留言等内容均应符合国家法律法规及社会公共利益，不得违反公序良俗、侵犯他人合法权益。用户应自行承担其所发表内容的法律责任，因用户违法或违反本协议规定引起的一切责任和后果均由用户自行承担，与小程序商城无关。
      </div>
      <br />
      <div>7.2 用户在小程序商城发表的言论不得包含下列任一内容：</div>
      <br />
      <div>7.2.1 违反宪法确定的基本原则的；</div>
      <br />
      <div>7.2.2 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</div>
      <br />
      <div>7.2.3 损害国家荣誉和利益的；</div>
      <br />
      <div>7.2.4 煽动民族仇恨、民族歧视，破坏民族团结的；</div>
      <br />
      <div>7.2.5 破坏国家宗教政策，宣扬邪教和封建迷信的；</div>
      <br />
      <div>7.2.6 散布谣言、扰乱社会秩序，破坏社会稳定的；</div>
      <br />
      <div>7.2.7 散布淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪等不良信息的；</div>
      <br />
      <div>7.2.8 侵害他人知识产权、商业秘密等合法权益的；</div>
      <br />
      <div>7.2.9 违反法律法规和行政规章的其他内容。</div>
      <br />
      <div>7.3 用户不得发表任何与本小程序商城销售商品无关的内容，不得在评论中恶意评价商家，不得使用不文明用语，不得发布广告、招聘信息等内容。用户的评论应当客观、真实、准确，不得有误导他人的情形。</div>
      <br />
      <div>7.4 用户发表的评论、评价、留言等一旦发表即为公开的信息，且不可撤回、修改。用户应自行注意控制个人信息的公开程度，防止个人信息被泄露。</div>
      <br />
      <div>7.5 小程序商城有权审核用户发表的评论、评价、留言等内容，若发现其违反本协议的规定或有损公共利益、侵害他人合法权益的，有权采取删除、屏蔽等措施，并有权对违规用户做出限制、禁言、注销账号等处理。</div>
      <br />
      <div>八、法律适用与争议解决</div>
      <br />
      <div>8.1 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。</div>
      <br />
      <div>8.2 如用户与我们发生争议，应通过友好协商的方式解决。协商不成的，用户同意将争议提交我们所在地有管辖权的人民法院管辖。</div>
      <br />
      <div>九、知识产权保护</div>
      <br />
      <div>9.1</div>
      <div>
        小程序商城平台的所有内容，包括但不限于网站标志、商标、专利、文字、软件、音频、图片、视频、图表、广告以及其他形式的内容均为小程序商城平台或其内容提供者所有，并受到中国法律和国际版权公约的保护。未经小程序商城平台或相关权利人事先书面同意，用户不得复制、传播、展示、表演、转载、修改、发行、出售、或以其他方式使用上述内容，或利用上述内容创建派生作品。
      </div>
      <br />
      <div>9.2</div>
      <div>
        用户在小程序商城平台上传、发布或分享的内容，包括但不限于文字、图片、音频、视频、图表等，应符合中国法律、法规、政策，不得侵犯他人知识产权、肖像权、隐私权等权利。用户应保证其对该等内容享有合法权利，且不会导致小程序商城平台违反任何法律、法规、政策等规定。如因用户违反本协议及法律法规等规定而导致小程序商城平台遭受任何第三方索赔、诉讼、责任等，则用户应承担全部责任。
      </div>
      <br />
      <div>9.3</div>
      <div>
        如用户认为在小程序商城平台上的内容侵犯了其知识产权等合法权益的，应及时向小程序商城平台提供书面通知并提供相关证明材料。小程序商城平台在收到符合法律规定和本协议要求的通知后，将尽快采取相应措施。如因小程序商城平台未能及时采取措施，导致用户权益受到进一步损害的，小程序商城平台不承担由此产生的任何责任。
      </div>
    </div>
  </view>
</template>

<style scoped>
div {
  text-indent: 2em;
}
</style>